app/controllers/users_controller.rb

INSERT INTO "users" ("surname", "firstname", "phone", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["surname", ""], ["firstname", ""], ["phone", ""], ["email", ""], ["created_at", "2017-10-18 13:27:08.434548"], ["updated_at", "2017-10-18 13:27:08.434548"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save